In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                     'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                     'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                     'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 
   and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float 
   column).

In [5]:
df["FlightNumber"].iloc[1]=10055.0
df["FlightNumber"].iloc[3]=10075.0

C:\Users\acer\Anaconda3\lib\site-packages\pandas\core\indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a 
new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [41]:
df1 = pd.DataFrame(df['From_To'])
df1

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_PaRis
4   Brussels_londOn

In [42]:
from_to=df1['From_To'].to_numpy()
list(from_to)

['LoNDon_paris',
 'MAdrid_miLAN',
 'londON_StockhOlm',
 'Budapest_PaRis',
 'Brussels_londOn']

In [43]:
From=[]
To=[]
for i in from_to:
    a=i.split("_")
    From.append(a[0])
    To.append(a[1])

In [44]:
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [45]:
To

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [47]:
df1['From']= From
df1['To']= To

In [48]:
df1.drop('From_To',inplace=True,axis=1)

In [49]:
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so 
that only the first letter is uppercase (e.g. "londON" should become "London".)

In [50]:
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [52]:
df1['From']=df1['From'].apply(lambda x: x.capitalize())

In [53]:
df1['To']=df1['To'].apply(lambda x: x.capitalize())

In [54]:
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [55]:
df.drop('From_To',inplace=True,axis=1)
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [57]:
df3=pd.concat([df1,df],axis=1)

In [58]:
df3

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value 
in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the 
unwanted RecentDelays column in df with delays

In [59]:
delays=pd.DataFrame(df['RecentDelays'])

In [60]:
delays.values

array([[list([23, 47])],
       [list([])],
       [list([24, 43, 87])],
       [list([13])],
       [list([67, 32])]], dtype=object)

In [61]:
delay_values=pd.DataFrame(delays.values[:,0])

In [62]:
delay=pd.DataFrame([i[0] for i in delay_values.values],columns=['delay_1','delay_2','delay_3'])

In [63]:
delay

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [73]:
df4=pd.concat([df3,delay],axis=1)
df4

,From,To,FlightNumber,RecentDelays,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045.0,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055.0,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065.0,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075.0,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,10085.0,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

In [74]:
df4.drop('RecentDelays',axis=1,inplace=True)

In [75]:
df4

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045.0,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055.0,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065.0,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075.0,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085.0,"""Swiss Air""",67.0,32.0,NaN